# Series

In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

In [2]:
#시리즈 변수 작성
x=Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
x.values

array([1, 2, 3, 4], dtype=int64)

In [4]:
x.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
#인덱스를 문자로 만들기
y=Series([1,2,3,4],index=['철수','영희','민수','은희'])
y

철수    1
영희    2
민수    3
은희    4
dtype: int64

In [6]:
#숫자인덱싱
y[0]

1

In [7]:
#문자인덱싱
y['철수']

1

In [8]:
#여러 자료 가져오기#1
y[[0,1,2]]

철수    1
영희    2
민수    3
dtype: int64

In [9]:
#여러 자료 가져오기#2
y[['철수','영희','민수']]

철수    1
영희    2
민수    3
dtype: int64

In [10]:
#여러 자료 가져오기#3(인덱스 슬라이싱)
y[1:3]

영희    2
민수    3
dtype: int64

In [11]:
#여러 자료 가져오기#4(문자 인덱스 슬라이싱, 콜론 뒤 인덱스도 포함)
y['철수':'민수']

철수    1
영희    2
민수    3
dtype: int64

In [12]:
#영희부터 은희의 값 입력
y['영희':'은희']=6
y

철수    1
영희    6
민수    6
은희    6
dtype: int64

In [13]:
#슬라이싱으로 지정된 범위의 값 여러개를 동시에 바꾸기
#바꾸고 싶은 값을 리스트로 전달
y['영희':'은희']=[2,3,4]
y

철수    1
영희    2
민수    3
은희    4
dtype: int64

In [14]:
#비교연산자를 통한 값 추출
y[y>2]

민수    3
은희    4
dtype: int64

In [15]:
#인덱스 값 존재 유무 알아보기 위해서는 다음과 같은 함수를 쓴다.
'철수' in y

True

In [16]:
#딕셔너리로 시리즈 만들기
#key=인덱스
#value=value 
dic_data={'경기도':'수원','강원도':'춘천','전라도':'광주','충청도':'천안'}
ser_dic=Series(dic_data)
ser_dic

경기도    수원
강원도    춘천
전라도    광주
충청도    천안
dtype: object

In [17]:
#인덱스에 '함경도'가 포함되어 있는 경우 
dic_data={'경기도':'수원','강원도':'춘천','전라도':'광주','충청도':'천안'}
ser_dic2=Series(dic_data, index=['경기도','강원도','전라도','함경도'])
ser_dic2

경기도     수원
강원도     춘천
전라도     광주
함경도    NaN
dtype: object

In [18]:
#None값 확인
pd.isnull(ser_dic2)

경기도    False
강원도    False
전라도    False
함경도     True
dtype: bool

In [19]:
#자료형들의 갯수 출력
ser_dic2.value_counts()

수원    1
춘천    1
광주    1
dtype: int64

In [20]:
#삭제#1
ser_dic2.drop('전라도')

경기도     수원
강원도     춘천
함경도    NaN
dtype: object

In [21]:
#삭제#2
ser_dic2.drop(['경기도','강원도'])

전라도     광주
함경도    NaN
dtype: object

In [22]:
#사라지지 않는다.
ser_dic2

경기도     수원
강원도     춘천
전라도     광주
함경도    NaN
dtype: object

In [23]:
ser_dic2.drop(['함경도'],inplace=True)
ser_dic2

경기도    수원
강원도    춘천
전라도    광주
dtype: object

In [24]:
#특정 value가 존재하는지 물어보는 함수
ser_dic2.isin(['수원'])

경기도     True
강원도    False
전라도    False
dtype: bool

# DataFrame

year|age|occupation|residence|goal
------|------|------|------|------
2013|22|대학생|서울|선생님
2014|23|대학생|서울|선생님
2015|24|마케터|서울|마케터
2016|25|마케터|서울|마케터
2017|26|마케터|서울|마케터

In [25]:
#데이터 프레임 라이브러리 추가
from pandas import DataFrame

In [26]:
# 딕셔너리로 데이터프레임 만들기
me={'year':[2013,2014,2015,2016,2017],'age':[22,23,24,25,26],
    'occupation':['대학생','대학생','마케터','마케터','마케터']}
frame=DataFrame(me)
frame

   year  age occupation
0  2013   22        대학생
1  2014   23        대학생
2  2015   24        마케터
3  2016   25        마케터
4  2017   26        마케터

In [27]:
#칼럼 순서바꿔서 데이터프레임 만들기
frame=DataFrame(me, columns=['year','occupation','age'])
frame

   year occupation  age
0  2013        대학생   22
1  2014        대학생   23
2  2015        마케터   24
3  2016        마케터   25
4  2017        마케터   26

In [28]:
#데이터프레임 만든 후 칼럼 순서바꾸기
frame[['age','year','occupation']]

   age  year occupation
0   22  2013        대학생
1   23  2014        대학생
2   24  2015        마케터
3   25  2016        마케터
4   26  2017        마케터

In [29]:
#데이터프레임에 빈 칼럼 추가하기('goal')
frame=DataFrame(me, columns=['age','year','occupation','goal'],index=me['year'])
frame

      age  year occupation goal
2013   22  2013        대학생  NaN
2014   23  2014        대학생  NaN
2015   24  2015        마케터  NaN
2016   25  2016        마케터  NaN
2017   26  2017        마케터  NaN

In [30]:
#goal에 데이터 입력
frame['goal']=['선생님','선생님','마케터','마케터','마케터']
frame

      age  year occupation goal
2013   22  2013        대학생  선생님
2014   23  2014        대학생  선생님
2015   24  2015        마케터  마케터
2016   25  2016        마케터  마케터
2017   26  2017        마케터  마케터

In [31]:
#residence에 데이터 입력
frame['residence']='서울'
frame

      age  year occupation goal residence
2013   22  2013        대학생  선생님        서울
2014   23  2014        대학생  선생님        서울
2015   24  2015        마케터  마케터        서울
2016   25  2016        마케터  마케터        서울
2017   26  2017        마케터  마케터        서울

In [32]:
#데이터프레임 조건검색(조건이 하나일 경우)
frame[frame['occupation']=='마케터']

      age  year occupation goal residence
2015   24  2015        마케터  마케터        서울
2016   25  2016        마케터  마케터        서울
2017   26  2017        마케터  마케터        서울

In [33]:
#데이터프레임 조건검색(조건이 여러개일 경우)
frame[(frame['occupation']=='마케터')&(frame['year']>=2016)]

      age  year occupation goal residence
2016   25  2016        마케터  마케터        서울
2017   26  2017        마케터  마케터        서울

In [34]:
#연도별로 만족도를 생각해 보고 satisfaction이란 Series로 만든다. 
#입력할때 index를 바꿔서 입력한다.
satisfaction=Series([2,5,4,1], index=[2013,2016,2014,2015])
frame['satisfaction']=satisfaction
frame

      age  year occupation goal residence  satisfaction
2013   22  2013        대학생  선생님        서울           2.0
2014   23  2014        대학생  선생님        서울           4.0
2015   24  2015        마케터  마케터        서울           1.0
2016   25  2016        마케터  마케터        서울           5.0
2017   26  2017        마케터  마케터        서울           NaN

In [35]:
#비교 연산자를 통한 데이터 입력
frame['happy']=frame['satisfaction']>3
frame

      age  year occupation goal residence  satisfaction  happy
2013   22  2013        대학생  선생님        서울           2.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [36]:
#값 기준 정렬
frame.sort_values('satisfaction')

      age  year occupation goal residence  satisfaction  happy
2015   24  2015        마케터  마케터        서울           1.0  False
2013   22  2013        대학생  선생님        서울           2.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [37]:
#인덱스 기준 정렬(오름차순)
frame.sort_index()

      age  year occupation goal residence  satisfaction  happy
2013   22  2013        대학생  선생님        서울           2.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [38]:
#인덱스 기준 정렬(내림차순)
frame.sort_index(ascending=False)

      age  year occupation goal residence  satisfaction  happy
2017   26  2017        마케터  마케터        서울           NaN  False
2016   25  2016        마케터  마케터        서울           5.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2013   22  2013        대학생  선생님        서울           2.0  False

In [39]:
#칼럼 기준 정렬(오름차순)
frame.sort_index(axis=1)

      age goal  happy occupation residence  satisfaction  year
2013   22  선생님  False        대학생        서울           2.0  2013
2014   23  선생님   True        대학생        서울           4.0  2014
2015   24  마케터  False        마케터        서울           1.0  2015
2016   25  마케터   True        마케터        서울           5.0  2016
2017   26  마케터  False        마케터        서울           NaN  2017

In [40]:
#칼럼 기준 정렬(내림차순)
frame.sort_index(axis=1,ascending=False)

      year  satisfaction residence occupation  happy goal  age
2013  2013           2.0        서울        대학생  False  선생님   22
2014  2014           4.0        서울        대학생   True  선생님   23
2015  2015           1.0        서울        마케터  False  마케터   24
2016  2016           5.0        서울        마케터   True  마케터   25
2017  2017           NaN        서울        마케터  False  마케터   26

In [41]:
#로우 지우기
frame.drop(2017)

      age  year occupation goal residence  satisfaction  happy
2013   22  2013        대학생  선생님        서울           2.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True

In [42]:
#로우 여러개 지우기
#리스트로 만들면 가능
frame.drop([2016,2017])

      age  year occupation goal residence  satisfaction  happy
2013   22  2013        대학생  선생님        서울           2.0  False
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False

In [43]:
#열 지우기#1
# axis=1이 열을 가리킨다. 기본적으로 데이터프레임은 로우 기반이기 때문에 axis=1이란 옵션을 추가해서 지울 수 있다.
frame.drop('age',axis=1)

      year occupation goal residence  satisfaction  happy
2013  2013        대학생  선생님        서울           2.0  False
2014  2014        대학생  선생님        서울           4.0   True
2015  2015        마케터  마케터        서울           1.0  False
2016  2016        마케터  마케터        서울           5.0   True
2017  2017        마케터  마케터        서울           NaN  False

In [44]:
#열 여러개 지우기#2
frame.drop(['age','goal'],axis=1)

      year occupation residence  satisfaction  happy
2013  2013        대학생        서울           2.0  False
2014  2014        대학생        서울           4.0   True
2015  2015        마케터        서울           1.0  False
2016  2016        마케터        서울           5.0   True
2017  2017        마케터        서울           NaN  False

In [45]:
#inplace=True로 원본 데이터 삭제
frame.drop(2013, inplace=True)
frame

      age  year occupation goal residence  satisfaction  happy
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [46]:
#가로축과 세로축 변환
frame.T

              2014   2015  2016   2017
age             23     24    25     26
year          2014   2015  2016   2017
occupation     대학생    마케터   마케터    마케터
goal           선생님    마케터   마케터    마케터
residence       서울     서울    서울     서울
satisfaction     4      1     5    NaN
happy         True  False  True  False

In [47]:
#칼럼 선택
frame['age']

2014    23
2015    24
2016    25
2017    26
Name: age, dtype: int64

In [48]:
frame['year']

2014    2014
2015    2015
2016    2016
2017    2017
Name: year, dtype: int64

In [49]:
#loc인덱서
frame.loc[2015]

age                24
year             2015
occupation        마케터
goal              마케터
residence          서울
satisfaction        1
happy           False
Name: 2015, dtype: object

In [50]:
frame.loc[2015:2017]

      age  year occupation goal residence  satisfaction  happy
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [51]:
frame.loc[2015:2017,'age']

2015    24
2016    25
2017    26
Name: age, dtype: int64

In [52]:
frame.loc[2015:2017,'age':'residence']

      age  year occupation goal residence
2015   24  2015        마케터  마케터        서울
2016   25  2016        마케터  마케터        서울
2017   26  2017        마케터  마케터        서울

In [53]:
#iloc인덱서
frame.iloc[0]

age               23
year            2014
occupation       대학생
goal             선생님
residence         서울
satisfaction       4
happy           True
Name: 2014, dtype: object

In [54]:
frame.iloc[1]

age                24
year             2015
occupation        마케터
goal              마케터
residence          서울
satisfaction        1
happy           False
Name: 2015, dtype: object

In [55]:
frame.iloc[0:2]

      age  year occupation goal residence  satisfaction  happy
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False

In [56]:
frame.iloc[2:5]

      age  year occupation goal residence  satisfaction  happy
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False

In [57]:
frame.iloc[0,0]

23

In [58]:
frame.iloc[0,1]

2014

In [59]:
frame.iloc[0,1:5]

year          2014
occupation     대학생
goal           선생님
residence       서울
Name: 2014, dtype: object

# 기타 함수

In [60]:
#데이터 프레임의 칼럼별로 요약통계량을 보여주는 함수
#count : 칼럼별 중복되지 않은 값의 갯수
#mean : 평균값
#std : 표준편차
#min : 최소값
#25%,50%,75% : 4분위수
#max : 최대값
frame.describe()

             age         year  satisfaction
count   4.000000     4.000000      3.000000
mean   24.500000  2015.500000      3.333333
std     1.290994     1.290994      2.081666
min    23.000000  2014.000000      1.000000
25%    23.750000  2014.750000      2.500000
50%    24.500000  2015.500000      4.000000
75%    25.250000  2016.250000      4.500000
max    26.000000  2017.000000      5.000000

In [61]:
#평균값
frame.mean()

age               24.500000
year            2015.500000
satisfaction       3.333333
happy              0.500000
dtype: float64

In [62]:
frame.sum()

age                       98
year                    8062
occupation      대학생마케터마케터마케터
goal            선생님마케터마케터마케터
residence           서울서울서울서울
satisfaction              10
happy                      2
dtype: object

In [63]:
#max함수
#칼럼별로 가장 큰 값, 혹은 빈도가 가장 많은 값
frame.max()

age               26
year            2017
occupation       마케터
goal             선생님
residence         서울
satisfaction       5
happy           True
dtype: object

In [64]:
#min함수
#칼럼별로 가장 큰 값, 혹은 빈도가 가장 적은 값
frame.min()

age                23
year             2014
occupation        대학생
goal              마케터
residence          서울
satisfaction        1
happy           False
dtype: object

In [65]:
#로우축의 이름과 칼럼축의 이름을 지정가능
frame.index.names=['연도']
frame.columns.names=['주제']
frame

주제    age  year occupation goal residence  satisfaction  happy
연도
2014   23  2014        대학생  선생님        서울           4.0   True
2015   24  2015        마케터  마케터        서울           1.0  False
2016   25  2016        마케터  마케터        서울           5.0   True
2017   26  2017        마케터  마케터        서울           NaN  False